data/cfdb/validation/cylinder_re40/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    cylinder
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    farfield
    {
        // freestream: fixedValue (1 0 0) on the upstream half of the outer
        // circle, zeroGradient on the downstream (wake) half.
        type            freestream;
        freestreamValue uniform (1 0 0);
        value           uniform (1 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
