data/cfdb/validation/cylinder_re40/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    cylinder
    {
        type            zeroGradient;
    }
    farfield
    {
        // freestreamPressure: fixedValue 0 upstream, zeroGradient downstream,
        // matching the freestream velocity BC on the same patch.
        type            freestreamPressure;
        freestreamValue uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
